app/Controllers/Admin.php

SELECT *
FROM `user_type`
---
    public function index()
    {

        // die("in Admin");
        //  View Ref :
        //  https://getbootstrap.com/docs/5.0/examples/sidebars/#
        // https://getbootstrap.com/docs/4.1/examples/dashboard/#

        /*        $session = \Config\Services::session();
                $session->set("account_type", trim('admin'));*/

        $page_data["page_name"] = "dash";

        //        get the list of all users

        $user_types = $this->db->table("user_type")->get()->getResult('array');

SELECT *
FROM `user_type`
---
    public function students()
    {
        $student_type_id = null ;
//        SEArch the list of users
//        Get the list of user types
//        .. get only user who have user_type of student

        $user_types = $this->db->table("user_type")->get()->getResult('array');

SELECT *
FROM `user_type`
---
    public function instructors()
    {
        $student_type_id = null ;
        //        SEArch the list of users
        //        Get the list of user types
        //        .. get only user who have user_type of instructors
        $user_types = $this->db->table("user_type")->get()->getResult('array');