app/Controllers/Instructor.php

SELECT *
FROM `course`
WHERE `id` = '9'
---
    public function open_course($course_id)
    {

        $builder = $this->db->table('course');
        $course = $builder->where('id', trim($course_id))->get()->getResult('array');

SELECT *
FROM `course`
---
    public function published_courses()
    {
        //        get published courses add by the current instructor
        $courses = $this->db->table("course")->get()->getResult('array');

SELECT *
FROM `chapter`
WHERE `course_id` = '9'
---
    private function getChapters($course_id)
    {

        $builder = $this->db->table('chapter');
        $chapters = $builder->where('course_id', trim($course_id))->get()->getResult('array');

SELECT *
FROM `chapter_type`
---
    private function getChapterTypes()
    {
        $builder = $this->db->table('chapter_type');
        $types = $builder->get()->getResult('array');